driver-tests/bpelse/misc/MiscJbi/test/LodeStarServer/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lod="http://localhost/heraldws_services/LodeStar">
  <soapenv:Body>
    <lod:validate>
      <message>Test</message>
    </lod:validate>
  </soapenv:Body>
</soapenv:Envelope>